[
    {
        "type": "groups",
        "prompt_template": "Based on the text about the Four Major Crews, create a single JSON object. It should have a \"name\" key (\"Four Major Crews\"), a \"summary\", and a nested list under a \"crews\" key detailing each crew. Your output must be ONLY the JSON object. Here is the text:\n---\n{text_batch}\n---",
        "text_batch": "Seoul, the land where\nmonsters\nfight.\nThe\nFour\nMajor Crews\nare the four biggest gangs in Seoul divided by the Han River into five regions: North, West, East, and South. 3 years prior to\nDaniel\ncoming to Seoul and entering\nJ High\n,\nGun\nwith the assistance of\nGoo\nunder the plan created by the\nTen Geniuses\n, would seek out four of the largest pre-established gangs in order to turn them into the four major crews, each tasked to make at least a hundred million won a month. The purpose of these crews was to employ minors to earn money in order to help\nCharles Choi\nkickstart his business, with the only condition being that they couldn't earn the money through illegal means as that would jeopardize his reputation. 3 out of the 4 crew heads became Gun's successors, with the goal being that one of his successors would unite the four crews under their leadership, earning them immense money and status, but none have been able to do so yet.\n3 years into the existence of the Four Major Crews, Charles Choi had become a pretty influential person in South Korea however he started to get paranoid that his criminal past would come back to bite him later, and the Four Major Crews were no exception. He would try and get rid of all evidence by getting Gun and Goo to denounce the Four Major Crews while catching them in the act of illegal practices, buying out businesses that have direct criminal ties to him and even murdering people from his past that posed a threat to his status. However despite his efforts, the last Four of the Major Crews still stands,\nWorkers\n.\nHistory\nSee article:\n2nd Generation\nBoth Gun and Goo sought successors for their business in the meantime, scouring Seoul for suitable candidates. Eventually Gun had to retire from the business and become Crystal's bodyguard, leaving Goo to collect the money by himself.\nUniting the four crews is a task given by Gun to candidates he considers worthy of becoming his successor. Gun not only makes an insane amount of money, he also has a lot of influence due to his wealth. As a result, many people are vying for his and Goo's position. Gun's only rule for someone to be a successor is that they do not engage in illegal activity, because that may get him into legal trouble. Goo has not given this task to anyone.\nGun's first candidate for the job was\nEli Jang\n, but he quit the crew business and disqualified himself. His second candidate was\nJake Kim\n, but he was disqualified due to the illegal betting ring.\nJohan Seong\nwas the third candidate, disqualified due to poor leadership and fake bank accounts. Gun has since offered candidacy to\nDaniel Park\nand\nZack Lee\n, but both have refused on grounds of principle.\nOrganization\nThe Four Major Crews have their own jurisdictions on all four sides of Seoul, with central Seoul remaining neutral. Each gang is responsible for paying a Hundred Million won (86,000 USD) as a monthly fee. While they were encouraged to earn their money through legal methods, illegal methods were expected and quietly allowed as long as they weren't caught. The four crews are divided as follows.\nCentral Seoul:\nBurn Knuckles\n,\nJ High School\n, and\nAllied\nWhile they aren't considered part of the Four Major; Burn Knuckles, and J High were considered a big threat enough to keep the Four Major crews from taking over Central Seoul completely.\nThe Burn Knuckles was founded by\nVasco\nduring his first year in high school, he would go around grabbing delinquents with his shoulder grip, warning them to stop smoking. The delinquents were so impressed by Vasco's strength and character that they decided to transfer to J High's Architecture department in order to join him, eventually forming the Burn Knuckles. Vasco would indirectly recruit all potential delinquents who could have joined any of the four major crews and would transform them into protectors of the weak. They would protect Central Seoul from foreign gangs, thus keeping Central Seoul in neutral territory.\nDue to the number of students who know martial arts, J High School would occasionally aid Burn Knuckles in their fight against the Four Major Crews. Unlike Burn Knuckles, the fighters from J High are not organized and only get involved when they personally get caught in the crossfire. While members like Big Daniel and Zack were always ready to jump into conflict when their friends were in danger, members like Vin Jin and Logan would only join the fight if it personally benefitted them. The only time J High would truly be untied was in their battle against\nHostel A\n.\nWith the end of the\nHunt for Big Deal\nand the prospect of the Workers finally uniting the Four Major Crews, Little Daniel realizes that they become a threat that he can no longer take on alone. He wasn't going to let the Workers continue to grow in power and finally decided to create an organized force to combat them, a crew. He founded Allied with only one goal, the collapse and eventual eradication of Workers. When the group was formed, he approached multiple people to join his cause.\nVasco\nquickly accepted the offer, bringing alongside the tactician\nJace Park\nand the manpower of\nBurn Knuckles\n.\nZack Lee\n, fresh from being trained at the Buddhist temple, joined alongside Vasco.\nJay Hong\njoined the group to assist Little Daniel in finding the Big Daniel and\nHudson Ahn\njoined in order to confront and get revenge on\nEli Jang\n. These were the original five members and eventually more people would join.\nNorth:\nGod Dog\n(Gangbuk)\nBefore Johan entered the picture, the Gangbuk region was ruled over by\nK-House\n, a crew run by\nJin Jang\nwhose main business is fake bank accounts. They would rule undisturbed until\nJohan Seong\nappeared, he wanted to rule over this region to impress Gun and become his successor. It was the only way to get on\nCharles Choi's\ngood side and get his mom her surgery. He defeated every grew in Gangbuk by himself and K-house was no different. After his takeover, he would change its name to God Dog, creating a new crew out of the collection of various Gangbuk crews he defeated in the past.\nThis was the second of the Four Major Crews Burn Knuckles and J High came face to face with and by far God Dog was the weakest, while they had the manpower, the crew had weak leadership. No one saw Johan as their leader but they still followed his orders as he maintained his leadership through fear and intimidation.\nJin Jang\nwould become second in command and was responsible for collecting the money and maintaining the headcount of the God Dogs. He would look loyal to Johan on the outside but behind closed doors he would use this position of power to create a coup of people who wanted to overthrow Johan as they hated being under his leadership, this coup would mainly contain members of K-House who wanted to be their own separate gang once again.\nJohan would try and stop his gang from earning money through scams, as illegal activity would ruin his chances as\nGun\n's successor. This would be God Dog's downfall as during the climax of the\nGod Dog Arc\n, the problems of poor leadership would finally shine through. The moment he commands his men to fight Burn Knuckles, he is hit in the head with a baseball bat by Jin and collapses on the floor. While Burn Knuckles and J High are shocked, God Dog laughs at Johan in his weak state. He asks his crew why they betrayed him, and Jin explains that they never liked him to start with. They only they waited this long just to get revenge on the Burn Knuckles and now they didn't need him anymore.  They try and cripple Johan, but he gets up quickly and starts to absolutely sherd his old crew, claiming that he would destroy the God Dogs and the Burn Knuckles and make a new crew. Before he gets a chance to beat down Jin, Gun comes out of the shadows and tells Johan that he is disqualified from the Four Major Crews and his successor due to his poor leadership. Not only was he unable to stop them from continuing illegal business but there wasn't any trust and could have turned on him at any moment. Johan begs Gun to reconsider but Gun refuses to, telling Johan he had his chance. As Johan starts crying for his mother and Gun warns him not to turn out like Jake, but like he did in the past, Johan becomes desperate and decides to fight Gun.  During the fight, Gun notices how much Johan has improved, with his only weakness being that he is physically weak, and to prove this he knocks him to the ground with one punch.\nAs Johan begins to cry, Gun comments on how sad it is that nobody is willing to help him, He prepares to remove his teeth as punishment but is pushed out of the way by Zack. While the J high trio stepped in to protect Johan from Gun, Johan didn't have any interest in thanking them and disappeared. Since then, most former members returned to\nK House\n, some tried joining Big Deal and some joined\nHostel\nA. Eventually, all of them would be absorbed into\nWorkers\nunder\nSamuel Seo\n's Fourth Affiliate. Johan Seong still calls himself a God Dog, although some say that he was the only God Dog to exist as he was the only one who believed in his ideals. After the gang's collapse, he refused the position of being the Ruler of Gangbuk, without being a successor of Gun, ruling over it would be pointless. This makes Gangbuk the only region in Seoul that is not ruled over by an overarching gang, due to this empty position, most small gangs that went into hiding due to Johan now came out of the shadows trying to get leadership to rule over Gangbuk. This conflict would escalate all the way into becoming another PTJ comic,\nQuestism\n.\nWest:\nBig Deal\n(Gangseo)\nBig Deal is most likely the oldest of the four major crews as it has a history in Gangseo with multiple heads. Not much is known about their origins but they were seen as just another gang, that was until \"The Boy of Promise\"  Sinu Han joined the gang. Due to his dedication and devotion to protecting the street that took him in, he joined\nBig Deal\nin order to rise up the ranks and become the new \"Big Boss\" and use the gang to protect the street. He would eventually accomplish that and took over the gang, he would make some adjustments to the gang's belief system to make life easier for the girls who lived on that street.\nTheir main business is an illegal betting ring. Jake's actions in the illegal betting arc led to him being locked up at a juvenile detention center, along with many other important members of Big Deal, but they were eventually released later on in the story.\n[\n1\n]\nEast:\nHostel\n(Gangdong)\nOriginally Back-Door was supposed to be the crew running in the East, but after\nDarius Hong\n, the head of the crew, was defeated by\nEli Jang\n, Gun changed his mind about them and made Hostel into a crew instead.\nAt the time of Chapter 149 Hostel was in the middle of a major makeover, but they were considered \"the worst criminals\".\nEli Jang\nused to be the head of the Hostel and was considered one of the top candidates to be Jong Gun's successor.\n[\n2\n]\n[\n3\n]\nTheir main operation involve the runaway fams.\nSouth:\nWorkers\n(Gangnam)\nThe Workers was originally described by Jace as \"beyond a teenage level,\" and they are seen as more of \"an enterprise than a crew.\" They are known to be hard to locate, as they dress like a typical professional person.\nThe Workers Head Chairman is\nEugene\nwho was scouted by\nGoo\n.\n[\n4\n]\nWorkers is composed of 4 Branches:\n4th Affiliate lead by\nAlexander Hwang\nand executive\nSamuel Seo\n; earns money through online illegal streaming;\n3rd Affiliate with\nVivi\nas the head and several executives, including\nXiaolong\n; they sell drugs at their club.\n2nd Affiliate has\nNeko\n(Mitsuki) as its president. They run a circus where they force criminals to play gruesome games where an audience bet on the players. They used to run a fighting den prior.\n1st Affiliate has\nHangyeoul Baek\nas its president. They have Plastic Surgery in Gangnam as it's business and currently Reinforced by\nWhite Tiger Job Centre\n, Workers 5th Affiliate and more. Other Information still unknown but they are probably protecting\nJinyoung Park\nagainst the people who want to get him and he's considered as\nCharles Choi's\nweakness.\nSynopsis\nThe 4 crews were first mentioned by\nDG\n, who told\nDaniel Park\nthat if he united the four crews he would tell him the secret of his bodies.\n[\n5\n]\nSince Daniel did not know who or what the Four Major Crews meant, he looked to\nJace Park\nfor advice since he \"seemed like [he]'d know about that\".\n[\n6\n]\nWebtoon,\nWhen Daniel Park asked Jace for information,\nJace Park\nsaid that there are two rumors surrounding the Four Major Crews: the first being that one person is behind the whole creation of the Four Major Crews. The second rumor is that each crew has their own illegal business operation.\n[\n7\n]\n[\n8\n]\nAlso the 4 crews do want to take Seoul in as territory to expand.\nReferences\n↑\nWebtoon,\nEpisode 301: Vs Johan Seong (2)\n↑\nWebtoon,\nEpisode 208: God Dog (10)\n,\n\"Then are you going to hand over your spot to Johan once this is over?\" Goo asked. \"Don't tell me you're still hung up over that kid. That kid who went off the grid. What was his name again? Oh yeah. Eli Jang.\"\n↑\nWebtoon,\nEpisode 211: God Dog (13)\n,\n\"Your leadership isn't much to look at like Jake (comparing God Dogs to Big Deal),\" Gun said. \"You don't make as much as money as the Workers (comparing God Dogs to the Workers). At least, show some decency like Eli who just disappeared...never mind (comparing God Dogs to Hostel).\"\n↑\nWebtoon,\nEpisode 310: Jake Kim (9)\n↑\nWebtoon,\nEpisode 146: Picnic (08)\n↑\nDuring the God Dog arc, Daniel decided to destroy the four crews and Vasco has vowed to help Daniel along with the Burn Knuckles.\n↑\nWebtoon,\nEpisode 149: Animal Cruelty (1/4)\n↑\nEpisode 212: God Dog (Finale)"
    }
]